app/controllers/customers_controller.rb

SELECT "customers".* FROM "customers"
---
  def index
    customers = Customer.all

SELECT "customers".* FROM "customers" WHERE "customers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    customer = Customer.find(params[:id])

INSERT INTO "customers" ("firstName", "lastName", "email", "phoneNumber", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    customer = Customer.create!(model_params)

SELECT "customers".* FROM "customers" WHERE "customers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "customers" SET "firstName" = $1, "updated_at" = $2 WHERE "customers"."id" = $3  [["firstName", "Chala"], ["updated_at", "2024-03-15 14:44:21.996219"], ["id", 1]]
---
  def update
    customer = Customer.find(params[:id])
    customer.update!(model_params)

SELECT "customers".* FROM "customers" WHERE "customers"."id" = $1 LIMIT $2  [["id", 69], ["LIMIT", 1]]
DELETE FROM "customers" WHERE "customers"."id" = $1  [["id", 70]]
---
  def destroy
    customer = Customer.find(params[:id])
    customer.destroy!