app/controllers/dress_transactions_controller.rb

  def index
    transactions= DressTransaction.all
---
SELECT "dress_transactions".* FROM "dress_transactions"