app/controllers/dresses_controller.rb

  def index
    dresses = Dress.all
---
SELECT "dresses".* FROM "dresses"

  def show
    dress = Dress.find(params[:id])
---
SELECT "dresses".* FROM "dresses" WHERE "dresses"."id" = $1 LIMIT $2  [["id", 25], ["LIMIT", 1]]

  def create
    dress = Dress.create!(model_params)
---
INSERT INTO "dresses" ("name", "category", "color", "size", "price", "quantity", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"  [["name", "dress1"], ["category", 0], ["color", "black"], ["size", 3], ["price", 3000.0], ["quantity", 2], ["created_at", "2024-03-18 06:52:09.953481"], ["updated_at", "2024-03-18 06:52:09.953481"]]

  def update
    dress = Dress.find(params[:id])
    dress.update!(model_params)
---
SELECT "dresses".* FROM "dresses" WHERE "dresses"."id" = $1 LIMIT $2  [["id", 27], ["LIMIT", 1]]
UPDATE "dresses" SET "category" = $1, "updated_at" = $2 WHERE "dresses"."id" = $3  [["category", 1], ["updated_at", "2024-03-18 06:52:09.964471"], ["id", 27]]

  def destroy
    dress = Dress.find(params[:id])
    dress.destroy!
---
SELECT "dresses".* FROM "dresses" WHERE "dresses"."id" = $1 LIMIT $2  [["id", 29], ["LIMIT", 1]]
DELETE FROM "dresses" WHERE "dresses"."id" = $1  [["id", 29]]